#include<iostream>

int main() {
	//プログラムの書き方について
	//1.目標を定義する
	// 1~2文で書ける程度に目標を明確にする
	// 例）
	// ・ユーザーが名前とそれに関連付けられた電話番号のリストを整理できるようにします。
	// ・興味深い見た目の洞窟を作り出すランダムダンジョンを生成します。
	// ・配当金の高い株式の推奨リストを生成します。
	// ・塔から落とされたボールが地面に着くまでにかかる時間をモデル化します。
	//
	//2.要件定義
	// 要件はソリューションが満たさなくてはいけない制約のこと
	// ニーズを満たすために備えるべき機能
	// 「どのように」ではなく「なにを」に焦点を当て、書く必要がある
	//　1つの問題から要件が複数生じる場合すべてを満たすまで完了しない
	// 
	//3.ツール、ターゲット、バックアップ計画を定義する
	// ・プログラムが実行されるターゲット アーキテクチャおよび/または OS を定義します。
	// ・使用するツールセットを決定します。
	// ・プログラムを一人で作成するか、チームの一員として作成するかを決定します。		
	// ・テスト / フィードバック / リリース戦略を定義します。
	// ・コードをバックアップする方法を決定します。
	//
	//4.難しい問題を簡単な問題に分解する
	// 難しい処理をトップダウン方式で分割してそれぞれ解決させる
	// ボトムアップでの分解も可能
	// 
	//5.イベントの順序を把握する
	// 4で分割した処理をどの順番で実装するか考える	
	// 
	//6.主な機能の概要
	// 5の順番に則り、コードの雛型をつくる
	// 
	//7.各機能を実装する
	// 雛型に対して処理を実装して雛型を作る
	// 
	//8.全体をテストする
	// 意図した通りに動くか確かめる
	// 
	//プログラムはパフォーマンスではなく保守性を重視する必要がある
	//ドナルド・クヌース：「早すぎる最適化は諸悪の根源である」
	// と言われている
	//
}